export default {
  footerLinks: {
    store: "Магазин",
    gifts: "Дары",
    leaderboard: "Таблица лидеров",
    profile: "Профиль",
  },
  store: {
    main: {
      title: "Купить и отправить подарки",
      subtitle: "Уникальные подарки для всех от Crypto Pay.",
    },
    gift: {
      subtitle:
        "Приобретите этот подарок, чтобы подарить его другому пользователю.",
      amount: "{remaining} из {total}",
      pay: "Оплатить {amount} {currency}",
      buy: "Купить подарок",
      recent: {
        title: "Последние действия",
        empty: "Этот подарок еще никто не купил.",
        send: "Отправить подарок",
        buy: "Купить подарок",
        sentTo: "отправил подарок пользователю",
        bought: "купил подарок",
      },
      invoice: {
        title: "Счет от приложения Gift App",
        subtitle: "Покупка подарка {name}.",
      },
    },
  },
  gifts: {
    title: "Отправляйте подарки в Telegram",
    subtitle:
      "Отправляйте подарки пользователям, которые можно сохранить в их профиле приложения.",
    card: {
      send: "Отправить",
    },
    sendConfirmation: {
      title: "Отправить подарок",
      gift: "Подарок",
      date: "Дата",
      price: "Цена",
      availability: "Доступность",
      action: "Отправить подарок контакту",
    },
    empty: {
      title: "У вас еще нет подарков.",
      action: "Открыть магазин",
    },
    received: {
      title: "Подарок получен",
      subtitle: "Вы получили подарок {name}.",
      action: "Открыть профиль",
    },
  },
  leaderboard: {
    search: "🔍 Поиск",
    giftsReceived: "{count} подарков",
  },
  profile: {
    received: "{count} полученных подарков",
    recent: "Последние действия",
    empty: {
      title: "Вы можете купить подарок, чтобы получить подарок в ответ.",
      action: "Открыть магазин",
    },
    count: "1 из {total}",
    details: {
      close: "Закрыть",
      title: "Отправить подарок",
      from: "От",
      date: "Дата",
      price: "Цена",
      availability: "Доступность",
      amount: "{available} из {total}",
    },
  },
  history: {
    title: "Последние действия",
    subtitle: "Здесь отображается ваша история действий.",
    empty: {
      title: "История пуста",
      subtitle: "Дарите и получайте подарки, чтобы здесь что-то появилось.",
      action: "Открыть магазин",
    },
    item: {
      bought: "Купил",
      sent: "Отправил",
      received: "Получил",
      to: "в",
      from: "от",
    },
  },
};
